/*
package HW_Java.HW09_11_22_BookingOfHotelRooms;

import HW_Java.HW09_11_22_BookingOfHotelRooms.HotelRooms.*;

class Hotel {
    public static void main(String[] args) {

/*  todo:  Необходимо написать программу для сохранения данных о бронирование номеров гостиницы.
        В вашей программе должно быть несколько типов номеров, например: standard, superior, de luxe, president.
         Естественно, номера отличаются ценой проживания. Кроме того, номера категории de luxe, president предполагают
        доступ в fitness center, для остальных категорий номеров доступ в fitness center оплачивается как отдельная услуга.
         Ваша программа должна позволять сотрудникам отеля сохранить и просмотреть данные о бронирование, отменить
        бронирование, посмотреть все бронирования. Данные о бронирование если хотите, можно задать в программе константно или ввести через Scanner
        Для отражения дат бронирования необходимо использовать написанный ранее класс MyDate
        ( в данной задаче не используем стандартные Java классы для работы с датой). В качестве дополнительных задач: в классе MyDate реализовать методы:
        -подсчета количества дней в заданном интервале дат
        -определения пересечения интервалов*//*


        RoomStandart r1 = new RoomStandart(25);
        RoomSurerior r2 = new RoomSurerior(44);
        RoomdeLuxe r3 = new RoomdeLuxe(78);
        RoomPresident r4 = new RoomPresident(99);

        Rooms[] bookings = new Rooms[0];
        {
            bookings = new Rooms[]{new Rooms(r1, new MyDate(2, "Desember", 23, "Desember", 2022, 23, 03, "not included in the price"),
                    r2, new MyDate(2, "Desember", 23, "Desember", 2022, 22, 20, "not included in the price"),
                    r3, new MyDate(2, "Desember", 23, "Desember", 2022, 20, 00, "included in the price",
                    r4, new MyDate(2, "Desember", 23, "Desember", 2022, 20, 00, "included in the price"))};

        }
    }

    private static void extracted(Rooms[] bookings) {
        for (Rooms e : bookings){
            System.out.println("=================================================");
            System.out.println(e);
        }
    }
}
*/











